tests/load-test.yaml
config:
  target: http://localhost:5555
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
        - get:
            url: "/api/population/state/Maryland/city/Annapolis"
        - get:
            url: "/api/population/state/New Mexico/city/Santa fe"
        - get:
            url: "/api/population/state/new_york/city/new_york"
        - get:
            url: "/api/population/state/florida/city/zzz"
        - get:
            url: "/api/population/state/canada/city/ankara"
        - put:
            url: "/api/population/state/arizona/city/avondale"
            text: 90564
        count: 100